database/postgreSQL/stressTest.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 50
      rampTo: 1000
      name: "ramp to peak"
    - duration: 180
      arrivalRate: 260
      name: "peak load"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Get Property ID"
    weight: 1
    flow:
    - get:
        url: "/?id={{$randomNumber(1,10000000)}}"
    - get:
        url: "/api/costHomeOwnership/rates?cost={{$randomNumber(1,10000000)}}&zipCode=24629&term=30&type=Fixed&downPay=20&credit=740&origYear=2019"